# Práctica Bases de Datos

## Parte I: SQL Scape Room 
Por parejas, resuelve el misterio del asesinato en http://mystery.knightlab.com/

## Parte II: Modelo Relacional

La empresa de venta de coches **KARLS** quiere crear un modelo de bases de datos. Para ello, nos ha compartido el fichero `ventas.csv`, que contiene sus ventas más recientes, con los siguientes campos:

*	no_orden: número de la orden
*	codigo_producto: código del producto comprado
*	cantidad_orden: cantidad comprada
*	precio_cada: precio de venta por unidad 
*	nombre_producto: nombre del producto
*	linea_productos: línea de productos
*	descr: descripción de la línea de productos
*	precio_compra: precio de compra de cada producto al proveedor
*	fecha_orden: fecha de la compra
*	no_cliente: número del cliente
*	nombre_cliente: nombre del cliente
*	tlf: teléfono del cliente
*	direccion: dirección del cliente
*	ciudad: ciudad del cliente
*	estado: estado o provincia del cliente
*	codigo_postal: código postal del cliente
*	pais: país del cliente

Por otro lado, KARLS quiere conocer el idioma de cada cliente para poder realizar campañas de marketing personalizadas en diversos idiomas. Para conocer el idioma oficial de cada país, disponemos del acceso a una base de datos con los siguientes parámetros:

*	Servidor: relational.fit.cvut.cz
*	Usuario: guest
*	Contraseña: relational
*	Nombre de la base de datos: world

![imagen](https://relational.fit.cvut.cz/assets/img/datasets-generated/world.svg)

In [1]:
import sqlite3
import pymysql
import pandas as pd

In [2]:
# Mostramos los datos del .csv en pandas
datos = pd.read_csv('ventas.csv')
datos

,no_orden,codigo_producto,cantidad_orden,precio_cada,nombre_producto,linea_productos,descr,precio_compra,fecha_orden,no_cliente,nombre_cliente,tlf,direccion,ciudad,estado,codigo_postal,pais
0,10100,S18_1749,30,136.00,1917 Grand Touring Sedan,Vintage Cars,Our Vintage Car models realistically portray a...,86.70,2003-01-06,363,Online Diecast Creations Co.,6035558647,2304 Long Airport Avenue,Nashua,NH,62005,USA
1,10100,S18_2248,50,55.09,1911 Ford Town Car,Vintage Cars,Our Vintage Car models realistically portray a...,33.30,2003-01-06,363,Online Diecast Creations Co.,6035558647,2304 Long Airport Avenue,Nashua,NH,62005,USA
2,10100,S18_4409,22,75.46,1932 Alfa Romeo 8C2300 Spider Sport,Vintage Cars,Our Vintage Car models realistically portray a...,43.26,2003-01-06,363,Online Diecast Creations Co.,6035558647,2304 Long Airport Avenue,Nashua,NH,62005,USA
3,10100,S24_3969,49,35.29,1936 Mercedes Benz 500k Roadster,Vintage Cars,Our Vintage Car models realistically portray a...,21.75,2003-01-06,363,Online Diecast Creations Co.,6035558647,2304 Long Airport Avenue,Nashua,NH,62005,USA
4,10101,S18_2325,25,108.06,1932 Model A Ford J-Coupe,Vintage Cars,Our Vintage Car models realistically portray a...,58.48,2003-01-09,128,"Blauer See Auto, Co.",+49 69 66 90 2555,Lyonerstr. 34,Frankfurt,NaN,60528,Germany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2991,10425,S24_2300,49,127.79,1962 Volkswagen Microbus,Trucks and Buses,The Truck and Bus models are realistic replica...,61.34,2005-05-31,119,La Rochelle Gifts,40.67.8555,"67, rue des Cinquante Otages",Nantes,NaN,44000,France
2992,10425,S24_2840,31,31.82,1958 Chevy Corvette Limited Edition,Classic Cars,Attention car enthusiasts: Make your wildest c...,15.91,2005-05-31,119,La Rochelle Gifts,40.67.8555,"67, rue des Cinquante Otages",Nantes,NaN,44000,France
2993,10425,S32_1268,41,83.79,1980’s GM Manhattan Express,Trucks and Buses,The Truck and Bus models are realistic replica...,53.93,2005-05-31,119,La Rochelle Gifts,40.67.8555,"67, rue des Cinquante Otages",Nantes,NaN,44000,France
2994,10425,S32_2509,11,50.32,1954 Greyhound Scenicruiser,Trucks and Buses,The Truck and Bus models are realistic replica...,25.98,2005-05-31,119,La Rochelle Gifts,40.67.8555,"67, rue des Cinquante Otages",Nantes,NaN,44000,France
2995,10425,S50_1392,18,94.92,Diamond T620 Semi-Skirted Tanker,Trucks and Buses,The Truck and Bus models are realistic replica...,68.29,2005-05-31,119,La Rochelle Gifts,40.67.8555,"67, rue des Cinquante Otages",Nantes,NaN,44000,France

Hay que pensar en las tablas de DIMENSIÓN y HECHOS

In [5]:
#dimension CLIENTE
cols = ["no_cliente", "nombre_cliente", "direccion", "ciudad", "estado", "codigo_postal", "pais"]
cliente = datos[cols].drop_duplicates()
cliente

,no_cliente,nombre_cliente,direccion,ciudad,estado,codigo_postal,pais
0,363,Online Diecast Creations Co.,2304 Long Airport Avenue,Nashua,NH,62005,USA
4,128,"Blauer See Auto, Co.",Lyonerstr. 34,Frankfurt,NaN,60528,Germany
8,181,Vitachrome Inc.,2678 Kingston Rd.,NYC,NY,10022,USA
10,121,Baane Mini Imports,Erling Skakkes gate 78,Stavern,NaN,4110,Norway
26,141,Euro+ Shopping Channel,"C/ Moralzarzal, 86",Madrid,NaN,28034,Spain
...,...,...,...,...,...,...,...
1619,204,Online Mini Collectables,7635 Spinnaker Dr.,Brickhaven,MA,58339,USA
1650,249,Amica Models & Co.,Via Monte Bianco 34,Torino,NaN,10100,Italy
1708,299,"NorwayGifts By Mail, Co.",Drammensveien 126A,Oslo,NaN,N 0106,Norway
1721,286,Marta's Replicas Co.,39323 Spinnaker Dr.,Cambridge,MA,51247,USA
1813,415,"Bavarian Collectables Imports, Co.",Hansastr. 15,Munich,NaN,80686,Germany

In [7]:
#Dimension producto
cols = ["codigo_producto", "nombre_producto", "linea_productos","descr", "precio_compra"]
producto = datos[cols].drop_duplicates()
producto

,codigo_producto,nombre_producto,linea_productos,descr,precio_compra
0,S18_1749,1917 Grand Touring Sedan,Vintage Cars,Our Vintage Car models realistically portray a...,86.70
1,S18_2248,1911 Ford Town Car,Vintage Cars,Our Vintage Car models realistically portray a...,33.30
2,S18_4409,1932 Alfa Romeo 8C2300 Spider Sport,Vintage Cars,Our Vintage Car models realistically portray a...,43.26
3,S24_3969,1936 Mercedes Benz 500k Roadster,Vintage Cars,Our Vintage Car models realistically portray a...,21.75
4,S18_2325,1932 Model A Ford J-Coupe,Vintage Cars,Our Vintage Car models realistically portray a...,58.48
...,...,...,...,...,...
110,S24_1628,1966 Shelby Cobra 427 S/C,Classic Cars,Attention car enthusiasts: Make your wildest c...,29.18
113,S24_2766,1949 Jaguar XK 120,Classic Cars,Attention car enthusiasts: Make your wildest c...,47.25
114,S24_2887,1952 Citroen-15CV,Classic Cars,Attention car enthusiasts: Make your wildest c...,72.82
115,S24_3191,1969 Chevrolet Camaro Z28,Classic Cars,Attention car enthusiasts: Make your wildest c...,50.51
116,S24_3432,2002 Chevy Corvette,Classic Cars,Attention car enthusiasts: Make your wildest c...,62.11

In [9]:
# TABLA DE HECHOS: COMPRAS
cols = ["no_orden", "codigo_producto", "cantidad_orden", "precio_cada", "fecha_orden", "no_cliente"]
compras = datos[cols].drop_duplicates()
compras

,no_orden,codigo_producto,cantidad_orden,precio_cada,fecha_orden,no_cliente
0,10100,S18_1749,30,136.00,2003-01-06,363
1,10100,S18_2248,50,55.09,2003-01-06,363
2,10100,S18_4409,22,75.46,2003-01-06,363
3,10100,S24_3969,49,35.29,2003-01-06,363
4,10101,S18_2325,25,108.06,2003-01-09,128
...,...,...,...,...,...,...
2991,10425,S24_2300,49,127.79,2005-05-31,119
2992,10425,S24_2840,31,31.82,2005-05-31,119
2993,10425,S32_1268,41,83.79,2005-05-31,119
2994,10425,S32_2509,11,50.32,2005-05-31,119
2995,10425,S50_1392,18,94.92,2005-05-31,119

Creamos una base de datos inicialmente vacía

In [10]:
conn = sqlite3.connect("karls.sqlite")

Guardamos nuestras tablas en la base de datos

In [12]:
cliente.to_sql("cliente", conn, index = False, if_exists = "replace")

In [13]:
producto.to_sql("producto", conn, index = False, if_exists = "replace")

In [14]:
compras.to_sql("compras", conn, index = False, if_exists = "replace")

Nos conectamos a la base de datos world y añadimos la tabla que relacione cada cliente con su idioma

In [15]:
database_host = 'relational.fit.cvut.cz'
username = 'guest'
password = 'relational'
database_name = 'world'
db = pymysql.connect(database_host,username,password,database_name)

In [16]:
pd.read_sql("SHOW TABLES", db)

   Tables_in_world
0             City
1          Country
2  CountryLanguage

In [17]:
pd.read_sql("SELECT * FROM CountryLanguage", db)

    CountryCode    Language IsOfficial  Percentage
0           ABW       Dutch          T         5.3
1           ABW     English          F         9.5
2           ABW  Papiamento          F        76.7
3           ABW     Spanish          F         7.4
4           AFG     Balochi          F         0.9
..          ...         ...        ...         ...
979         ZMB      Tongan          F        11.0
980         ZWE     English          T         2.2
981         ZWE     Ndebele          F        16.2
982         ZWE      Nyanja          F         2.2
983         ZWE       Shona          F        72.1

[984 rows x 4 columns]

In [21]:
query = """
SELECT Name, Language, IsOfficial, Percentage

FROM CountryLanguage
JOIN Country
ON CountryLanguage.CountryCode = Country.Code
WHERE Percentage = (SELECT MAX(Percentage)
                        FROM CountryLanguage
                        WHERE Country.Code = CountryLanguage.CountryCode)

"""

idiomas = pd.read_sql(query,db)
idiomas

             Name        Language IsOfficial  Percentage
0           Aruba      Papiamento          F        76.7
1     Afghanistan          Pashto          T        52.4
2          Angola       Ovimbundu          F        37.2
3        Anguilla         English          T         0.0
4         Albania       Albaniana          T        97.9
..            ...             ...        ...         ...
236         Yemen          Arabic          T        99.6
237    Yugoslavia  Serbo-Croatian          T        75.2
238  South Africa            Zulu          T        22.7
239        Zambia           Bemba          F        29.7
240      Zimbabwe           Shona          F        72.1

[241 rows x 4 columns]

In [22]:
idiomas.to_sql("idiomas", conn, index=False, if_exists = "replace")

In [24]:
pd.read_sql("SELECT name FROM sqlite_master WHERE type ='table'", conn)

       name
0   cliente
1  producto
2   compras
3   idiomas

In [31]:
#Relacionar 
query = """
SELECT no_cliente, pais,Language

FROM cliente
LEFT JOIN idiomas
ON cliente.pais = idiomas.Name
WHERE Language is null
"""
pd.read_sql(query,conn)

    no_cliente pais Language
0          363  USA     None
1          181  USA     None
2          131  USA     None
3          486  USA     None
4          187   UK     None
5          129  USA     None
6          124  USA     None
7          424  USA     None
8          112  USA     None
9          151  USA     None
10         324   UK     None
11         198  USA     None
12         447  USA     None
13         161  USA     None
14         320  USA     None
15         205  USA     None
16         379  USA     None
17         487  USA     None
18         219  USA     None
19         321  USA     None
20         347  USA     None
21         462  USA     None
22         175  USA     None
23         339  USA     None
24         489   UK     None
25         319  USA     None
26         455  USA     None
27         475  USA     None
28         495  USA     None
29         239  USA     None
30         173  USA     None
31         240   UK     None
32         328  USA     None
33         456  USA     None
34         450  USA     None
35         201   UK     None
36         362  USA     None
37         157  USA     None
38         204  USA     None
39         286  USA     None

In [32]:
#Modifico la tabla idiomas
query = """
SELECT CASE WHEN Name="United States" THEN "USA"
            WHEN Name = "United Kingdom" THEN "UK"
            ELSE Name END AS Name,
        Language, 
        IsOfficial,
        Percentage

FROM CountryLanguage
JOIN Country
ON CountryLanguage.CountryCode = Country.Code
WHERE Percentage = (SELECT MAX(Percentage)
                        FROM CountryLanguage
                        WHERE Country.Code = CountryLanguage.CountryCode)

"""

idiomas = pd.read_sql(query,db)
idiomas

             Name        Language IsOfficial  Percentage
0           Aruba      Papiamento          F        76.7
1     Afghanistan          Pashto          T        52.4
2          Angola       Ovimbundu          F        37.2
3        Anguilla         English          T         0.0
4         Albania       Albaniana          T        97.9
..            ...             ...        ...         ...
236         Yemen          Arabic          T        99.6
237    Yugoslavia  Serbo-Croatian          T        75.2
238  South Africa            Zulu          T        22.7
239        Zambia           Bemba          F        29.7
240      Zimbabwe           Shona          F        72.1

[241 rows x 4 columns]

In [22]:
idiomas.to_sql("idiomas", conn, index=False, if_exists = "replace")

In [33]:
# Relacionar cada cliente con su idioma
query = """
SELECT no_cliente, pais,Language

FROM cliente
LEFT JOIN idiomas
ON cliente.pais = idiomas.Name

"""
idiomas_cliente = pd.read_sql(query,conn)

In [34]:
pd.set_option("display.max_rows", 100)
idiomas_cliente

    no_cliente         pais        Language
0          363          USA            None
1          128      Germany          German
2          181          USA            None
3          121       Norway       Norwegian
4          141        Spain         Spanish
5          145      Denmark          Danish
6          278        Italy         Italian
7          131          USA            None
8          385  Philippines        Pilipino
9          486          USA            None
10         187           UK            None
11         129          USA            None
12         144       Sweden         Swedish
13         124          USA            None
14         172       France          French
15         424          USA            None
16         381      Belgium           Dutch
17         148    Singapore         Chinese
18         216        Spain         Spanish
19         382      Austria          German
20         114    Australia         English
21         353       France          French
22         350       France          French
23         103       France          French
24         112          USA            None
25         458        Spain         Spanish
26         151          USA            None
27         324           UK            None
28         198          USA            None
29         447          USA            None
30         323  New Zealand         English
31         250       France          French
32         242       France          French
33         496  New Zealand         English
34         282    Australia         English
35         161          USA            None
36         334      Finland         Finnish
37         320          USA            None
38         205          USA            None
39         379          USA            None
40         276    Australia         English
41         487          USA            None
42         311      Finland         Finnish
43         333    Australia         English
44         219          USA            None
45         186      Finland         Finnish
46         473        Italy         Italian
47         321          USA            None
48         347          USA            None
49         227      Denmark          Danish
50         452      Austria          German
51         462          USA            None
52         448       Sweden         Swedish
53         233       Canada         English
54         175          USA            None
55         386        Italy         Italian
56         344        Spain         Spanish
57         171       France          French
58         167       Norway       Norwegian
59         339          USA            None
60         484        Spain         Spanish
61         489           UK            None
62         211    Hong Kong  Canton Chinese
63         259      Germany          German
64         471    Australia         English
65         146       France          French
66         319          USA            None
67         455          USA            None
68         475          USA            None
69         357  New Zealand         English
70         202       Canada         English
71         495          USA            None
72         177        Japan        Japanese
73         406       France          French
74         256       France          French
75         166    Singapore         Chinese
76         189      Ireland         English
77         314      Belgium           Dutch
78         239          USA            None
79         298  Switzerland          German
80         173          USA            None
81         240           UK            None
82         328          USA            None
83         412  New Zealand         English
84         260       Canada         English
85         209       France          French
86         456          USA            None
87         450          USA            None
88         201           UK            None
89         398        Japan        Japanese
90         362          USA            None
91         157          USA            None
92         119       France          French
93         204          USA            None
94         249        Italy         Italian
95         299       Norway       Norwegian
96         286          USA            None
97         415      Germany          German

In [35]:
idiomas_cliente.to_sql("idiomas_cliente", conn, index=False, if_exists = "replace")

In [36]:
pd.read_sql("SELECT name FROM sqlite_master WHERE type ='table'", conn)

              name
0          cliente
1         producto
2          compras
3          idiomas
4  idiomas_cliente

 Puedes generar el diagrama de la base de datos en https://dbdiagram.io/d
 <img src="https://i.ibb.co/4PXndfB/Ejercicio2.png">

¿Cuál es el producto que aporta más beneficios?

In [38]:
query = """
SELECT nombre_producto, SUM(cantidad_orden*(precio_cada-precio_compra)) AS Beneficio

FROM compras
JOIN producto
ON compras.codigo_producto = producto.codigo_producto
GROUP BY nombre_producto
ORDER BY Beneficio DESC
"""
pd.read_sql(query,conn)

                          nombre_producto  Beneficio
0             1992 Ferrari 360 Spider red  135996.78
1                1952 Alpine Renault 1300   95282.58
2                       2001 Ferrari Enzo   93349.65
3    2003 Harley-Davidson Eagle Drag Bike   81031.30
4                       1968 Ford Mustang   72579.26
..                                    ...        ...
104          1930 Buick Marquette Phaeton   12536.80
105      1936 Mercedes Benz 500k Roadster   11841.39
106                     1982 Ducati 996 R   11397.92
107                      Boeing X-32A JSF   11233.33
108           1939 Chevrolet Deluxe Coupe    6904.85

[109 rows x 2 columns]